[
    {
        "title": "This is not a suicide note!",
        "content": "Three months ago, I learned of my Uncle's passing. We weren't particularly close but he left me one of his houses in the will. I was touched but just wanted to sell it off. I am a fairly new father of twin girls and didn't need another thing to manage right now.\n\nTo speed up the process, I decided to travel across the country to live in the house until a sale was assured. My job just requires a laptop and phone so I was approved to work remotely for the time being. Unfortunately, my wife had to stay at her job so I had to come alone.\n\nAt first, I treated it as a mini-vacation. I had hoped it would only last a week but the process was more involved than I thought. I had a realtor taking care of most things but, after a month, I'm still here.\n\nI noticed things going wrong right away. Stuff was never where I last placed it. I'd see shadows out of the corner of my eye. I've lose track of time constantly.\n\nI thought it was caused by stress. Loneliness. Except for the few times the Realtor came by with prospective buyers, the house was the quietest place I had ever been in.\n\nBefore I completely lost my mind, the neighbor came by with a dog. She was an elderly woman who explained that she had been dog-sitting while my Uncle was in the hospital. Now that I was here, she thought I should take Buster, the golden retriever.\n\nI thought the neighbor might have been \"forgetful\" because she seemed to think my Uncle had just passed last week. Either way, I fell in love with Buster and his presence was exactly what I needed. I even thought it would be a tremendous present to bring home to my girls. I just hoped my wife would feel the same way.\n\nHowever, even the dog could tell something was wrong with the house. Buster accepted his new living arrangements pretty quickly but would never willingly go upstairs. This was alright with me at the time. I thought it would make it easier to keep track of him.\n\nThen, Buster disappeared.\n\nLiterally, one second he was standing right behind me as I was opening the treat jar to give him a snack. My eyes left him for just a moment to put the jar back and then he was gone.\n\nI ran through the whole house calling his name. The kitchen was connected to the living room and on the other end of that was the master bedroom and study. The other end of the kitchen led to a dining room which was connected to the entrance hall that also led into the living room and stairs to the second floor.\n\nAfter walking upstairs, you had a choice of right or left along a balcony that overlooked the living room on one side and entrance on the other. Going left led immediately to a guest room and game room.\n\nGoing right led to two more guest rooms and a bathroom at the end of the hall. I looked in every room and had to accept that somehow the dog made it outside, even though there was no doggy door and every door and window had been closed and locked.\n\nSo I searched the surrounding neighborhood for another hour before giving up. I was thinking about making flyers when I opened the front door and heard Buster scrambling towards me from the kitchen.\n\nI was ecstatic of course but I just couldn't wrap my head around how I could have missed him. I let Buster sleep in the bed with me that night. In hindsight, it was a huge mistake but it made me feel better at the time.\n\nThings picked up at work though and I soon forgot about all the strangeness surrounding this house. Clients called me constantly but we were getting a lot done and I landed multiple large contracts in a row. I was working around the clock but I knew I'd be due a promotion once I returned to the home office.\n\nSeveral times I'd get lost in a phone call or spreadsheet and suddenly find that it was nighttime. I'd be so absorbed with work that I would block out Buster whining for food or to go outside. I started to set alarms to keep track but I had too many important clients to slow down.\n\nI was on top of the world but my health was starting to suffer. I'd forget to eat and even sleep sometimes. There was always something else to do or someone to talk to. I even got better at taking care of Buster, better than I was taking care of myself at least.\n\nThen my good mood ended with a bang. Literally. Buster was whining behind me as I finished another spreadsheet. Then we both heard a door slam upstairs.\n\nFor the first time since I brought him inside, Buster ran upstairs by himself. I almost called the cops but I felt silly with the phone in my hand. I started to doubt I had heard anything at all.\n\nAnd if there were an intruder, surely Buster would have been making more noise. So I mustered all the courage I could manage and crept upstairs with frying pan as my weapon.\n\nIt was dark upstairs but enough moonlight was coming in from the downstairs windows for me to make out Buster standing in front of the bathroom. I had purposely closed every door when I last came through here looking for the lost dog but this door was now wide open.\n\nI flipped on the hallway light but nothing happened. With no better ideas, I raised my frying pan high and walked slowly to the bathroom. There was no window in here so it was pure darkness inside.\n\nI was terrified.\n\nBizarrely, Buster just looked frozen. His tail stood straight up and he just stood there pointed towards the door. I tried to take it as a good sign that he still wasn't barking. That's what finally got me through the threshold and into the bathroom.\n\nThe whole time my eyes had been getting used to the darkness and the bathroom was too small for there to have been anyone there without me noticing. I started to relax when I took a step forward into something sticky.\n\nI suddenly realized that I had my cell phone in my pocket. I pulled it out and turned it on to cast some light on the floor. I immediately dropped it at the sight of the bright red liquid that surrounded my feet.\n\nI fled the upstairs and this triggered Buster to follow. This time I had no trouble calling the police. Thankfully, there was already a patrol car nearby so two officers arrived within a couple of minutes.\n\nTheir powerful flashlights cut through the darkness like knives but they soon found nothing was wrong with the upstairs lights. Something did appear to be wrong with my pipes though as they called out from above that the puddle was just rusty water.\n\nBecause of their insistence, I climbed up the stairs again and clearly saw a muddy brown puddle in the bathroom. The banging must have been from a pipe breaking. Both cops had a laugh at my expense but were otherwise understanding.\n\nThey even gave me a number of good plumber though my cell phone was ruined after I dropped, and left, it in the puddle. I would have to use the one landline in the kitchen from now on.\n\nI let them out and promised to call the plumber first thing in the morning. Yet, as exhausted as I was, I couldn't go to sleep over that excitement so I stayed up to draft some more important documents for my company.\n\nBefore I knew it, Buster had made another mess in the living room. I was dead tired and said somethings to Buster that maybe I shouldn't have and I did some things to him that I know I really shouldn't have.\n\nI decided to do something about the stress I had been under and I spoke to my supervisor that same morning. To my surprise, they were happy to let me have the week off as a sort of mental vacation. Just like that, all my outstanding work was taken away.\n\nWith nothing else to do, I tried to focus on Buster. I played games with him and fed him a bunch of treats to make up for my earlier neglect.\n\nThen I found the first message.\n\nI didn't notice it for some time since I had been avoiding the second floor. But I realized that I hadn't actually called the plumber. Before doing so, I went upstairs to see if things had gotten any worse.\n\nInstead, I immediately saw a message written in red on the hallway wall. It read, \"Losing your mind?\"\n\nFor a second, I kinda did. I was scared to death at the thought that someone had to have sneaked into my house while I was there. Probably when I was sleeping.\n\nI won't bear repeating everything I said or did right after, let's just say I hadn't become any braver since the banging. Eventually, I unlocked my bedroom door and made my way to the kitchen with Buster leading the way.\n\nI called the police again. Those same two officers were able to show up and then, slowly, we cleared every inch of the house. Yet, we found no one. Everything was locked. No sign of forced entry.\n\nThe police actually took me seriously, something that bewildered me at the time, and admitted that this isn't the first house in this neighborhood to experience this. There had been a series of break-ins where nothing was stolen but the police officers still offered to have a car sit outside for the night.\n\nEven though I took them up on this, I soon realized that I'd never get to sleep tonight in this house. So I called my only friend in town, and really in the whole state, an old college roommate who coincidentally lived 30 minutes away.\n\nHe offered to pick me and Buster up in a few hours so I busied myself with packing up my suitcase. I didn't know how long I would need so I pretty much packed everything I had brought with me to the house in the first place.\n\nI left my room to pick up some doggy toys when my friend called to say he was waiting outside. I decided to hang up the phone and meet him immediately. I needed the human company and he could help me move my stuff.\n\nBut the driveway was empty. There was no friend, no car. I called him back immediately and he insisted he was outside. I listened to him get out of his car and walk up to the front door. He knocked and I could hear the door open and an elderly woman greet him.\n\nMy friend asked for my name and mentioned my Uncle. The woman said she had never heard of either of us. After thanking her, my friend left and asked me if I had gotten all that. I told him I must have given him the wrong address. He rattled off the correct one and confirmed he was there.\n\nAfter asking him to wait and I left the house again. I walked out to the street and looked back at the numbers written on the curb and on the mailbox. Only there weren't any numbers. Just a message, \"Losing your mind?\" on the curb. Written in red.\n\nThe temptation to leave right away was great. I could just start walking and never stop. But I had to get my stuff and, more importantly, Buster so I entered the house one last time. When I came back to the room, my suitcase was empty. Everything I had just spent the last hour packing up was back in its' proper place.\n\nDespite how impossible this was, I focused on only one goal. We needed to leave. I put a leash on Buster and was shocked to see how haggard he was. I resolved to make it up to him when this was all over.\n\nI tried to leave out the front door like nothing was wrong but I couldn't open it. The knob turned freely but the deadbolt wouldn't slide back. I was really scared now but Buster's presence helped. I knelt down to give him a hug and he gave me an idea while licking my face.\n\nWhatever was happening, it sure wasn't the result of a maniac hiding in my house. Still, I didn't know what forces were actually opposing me so I walked to the backyard and said loudly, \"Well, Buster, time for a little walk!\"\n\nThe glass door slid open easily.\n\nBuster bounded out happily. I guess it had been a long time since I let him outside. I followed more tentatively and, for the first time, examined the backyard closely. There was a iron fence surrounding the yard with another space between the bars that Buster could slip through.\n\nAnd then I saw it. A tree that grew too close to the fence and had several branches extending through and above it. I assumed the gate would be supernaturally locked too so this was my exit.\n\nBuster didn't need any prodding. He waited patiently for me on the other side as I painfully pulled myself up and over the fence. I was suddenly aware of how weak and tired my recent lifestyle had made me.\n\nWhen I was in the process of climbing down the tree on the other side, Buster growled once and then took off like a shot, towards a nearby hill. I jumped down and gave chase.\n\nHe disappeared over the top and I scrambled to keep up on the surprisingly steep surface. Luckily, I found where someone had laid some stone bricks into the side for an easier way up.\n\nIt was still steep enough that I had to focus on placing my feet correctly to keep from sliding so I was looking down when my next reach up resulted in my hand grabbing carpet.\n\nConfused, I looked up see the second floor landing. I looked down to see the rest of the stairs that led to the entrance hall and living room of the house. Buster was nowhere to be found.\n\nDemoralized and dead tired, I crawled the final steps and just sat on the landing for awhile, occasionally calling for Buster. Eventually, the kitchen phone rang.\n\nWhatever ghosts were messing with me, I realized they couldn't stop outside forces from helping. I tumbled down the stairs in my haste and landed hard on the cold tiles below. But I was only dazed for second and soon was in the kitchen with the phone in my hand.\n\nMy wife's warm voice filled me with hope. She was concerned that she hadn't heard from me in awhile. I couldn't recall the last time I had even tried.\n\nShe was trying to tell me that my work hadn't heard from me in a week while I tried to tell her to call the police. Her words gave me pause though.\n\nI asked, \"What do you mean? I was given the week off?\"\n\n\"Dear? I thought you were supposed to continue working as soon as you got there.\"\n\n\"Uh, yeah but they gave me a week off because of all the stress I've been under. Wait a second. How long have I been out here?\"\n\n\"Honey, you've been gone almost 9 days now.\"\n\nMy stomach sunk but I didn't hesitate to say, \"Listen, you need to call the cops. Something is wrong. I think I'm having a medical emergency.\"\n\nI had just been trying to come up with an excuse to limit the amount of follow up questions but I ended up realizing that this was actually the most likely explanation.\n\nMaybe I was just suffering from a gas leak or brain tumor. Ironically, either of those options seemed preferable than living in a haunted house.\n\nMy wife asked, \"Baby, what's wrong? Are you OK?\"\n\nI thought I saw a shadow move out of the corner of my eye as I answered, \"Yes, I'm OK, but no, I need help. There's something wrong about this house.\"\n\n\"You aren't making any sense.\"\n\n\"Just listen to me, call the police and tell him my uncle's name. Tell them to come to this house and an ambulance might be needed. Please help me.\"\n\n\"Please help you? Pretty please? With a cherry on top?\"\n\nI stared at the phone in my hand as my wife's voice continued to come out of it. It sounded like her but in a mocking tone I've never actually heard from her before.\n\nShe said, \"Does your tummy hurt? When's the last time you ate? I wonder what Buster tastes like.\"\n\nI slammed the phone down but whatever it was on the other side was right. My stomach was hurting. I couldn't remember the last time I had eaten. On cue, I heard Buster whining from upstairs.\n\nOnly after I started running towards the stairs did I notice just how bruised and sore my legs were from my spill down those steps. I pushed through the pain and climbed the stairs yet again.\n\nBuster was back in front of the bathroom, lying on his side and looking thinner than I had ever seen him. \"Losing your mind?\" was written all over the hallway now, including on the ceiling and floor. I no longer had any doubt the messages were written in blood, some of them were still dripping.\n\nI walked over and picked up Buster while a banging started at my front door. I would have jumped if Buster hadn't been weighing me down. I heard the front door open and whoever it was identified themselves as the police. I even recognized the voice as belonging to one of the officers who had visited previously. Why can't I remember his name?\n\nAfter calling out that I was upstairs, I turned with Buster and found the hallway stretched before me, many times its original length. Despite how thin he looked, Buster felt heavier than ever. I knew this was all just some sort of trick to not get me in touch with the police officer.\n\nI thought I must have really been talking to my wife. She had to have come through with calling the police and the ghosts just distorted the end of the call. So I started my trek back to the stairs and shuffled my feet as fast as I could, yelling all the way.\n\nBut then a voice answered the police officer. A woman's voice. My wife's voice. I could hear her say, \"I'm sorry, my husband wasn't feeling well. He's resting in the bedroom. Can I help you?\"\n\nI screamed as loud as I could just to get attention. But it was no use. I heard the officer say, \"I'd like to check up on him, all the same.\"\n\n\"Sure, sure, come in. He's right through here.\"\n\nIt was right out of a nightmare. I was sweating profusely while every step seemed to get me nowhere. I tried to speed up but the hallway just stretched further.\n\nAnd then I heard a man's bloodcurdling scream from downstairs. Suddenly the hallway snapped back and I found myself somehow right at the top of the stairs. \n\nMy momentum couldn't be stopped. I fell down the stairs and landed hard.\n\nOn top of Buster.\n\nHe howled in pain but at least he was alive. I saw a long thick trail of blood go around the corner and under my closed bedroom door.\n\nThere was still a shadow of something under the door. I painfully crept to the kitchen and grabbed my trusty frying pan before making my way back to the bedroom door, as quietly as I could.\n\nMy eyes watched the moving shadows nervously. Whatever was waiting there had killed a man. That meant it could kill me. \n\nBut if it could have a physical impact then surely it had to be susceptible to a physical impact too. \n\nSo I raised the frying pan and slowly started to turn the handle. Before I made much progress, the door flew open on its own and something turned suddenly to me.\n\nI swung my frying pan down. The cop stood before me, a smile frozen on his face. We both looked down at the knife plunged into his chest. My hand was still wrapped around the handle.\n\nHe fell to the side and I fell backwards to sit heavily on the now clean floor. I was positive I had picked up the frying pan. I could remember it's weight. But now I also remembered going to the kitchen and pulling out the knife.\n\nI seriously wondered if I was losing my mind. I looked down to find I had the knife in my hands again. I dropped it at once and crawled back to check on Buster.\n\nHe wasn't moving. I put my head on his flank and was devastated to feel he was still warm but not breathing. I didn't know what to do so I did nothing.\n\nI did nothing for a long time. I was lethargic but somehow made it to the couch in the living room. I waited there until nightfall and then slept on the couch.\n\nWhen I woke up, I waited some more. I wasn't sure what I was waiting for but nothing horrible was happening to me while I waited. I wasn't in a hurry to change that.\n\nBut the bodies of Buster and the cop were still there. I needed to do something. My stomach rumbled as I finally got off the couch. That was another problem with just staying put.\n\nFirst things first, I found a shovel in an outdoor closet attached to the backyard porch. Digging the hole was exhausting so I settled for just burying Buster now. I planned on getting to the cop after finding something to eat.\n\nI picked up Buster and carried him outside. His fur was still so warm. It was hard to believe he was gone. But there was no life behind his big brown eyes. I gently laid him down in the hole and got to work.\n\nSome time later I wandered into the kitchen and raided the pantry. The house was quiet apart from my efforts. Whenever I stopped moving, the silence was complete.\n\nI wondered if the ghosts had just been trying to make me a murderer after all. Now that their goal had been met, maybe they would leave me alone for awhile.\n\nJust in time because I was starving and didn't need any more distractions. I opened a box of cereal and had a handful up to my lips when I paused.\n\nHow could I tell I was actually eating what I was looking at? What if I had actually been opening a box of rat poison?\n\nI still wasn't sure what these ghosts were capable of. I imagined the food turning into worms after it was already in my mouth.\n\nWith that thought, I threw the cereal to the ground and stomped off, no longer hungry. I needed to concentrate my efforts on leaving this place.\n\nRight on cue, I walked by the front door.\n\nIt was wide open.\n\nInstinctively, I made a leap for it before stopping with my outstretched hand just a foot short of the door. This had to be another trick.\n\nI could see the door slamming shut in my face or even taking a few of my fingers with it. I could feel a breeze enter the house but I was too scared to move.\n\nThis was the most impossible situation I had ever been in or even heard of. All of my senses had failed me before. However, my need for freedom eventually caused my feet to move.\n\nUpon slowly exiting the house, I saw the cop car just sitting in my driveway. The door was unlocked and the keys were sitting in the front seat.\n\nMy mind went wild trying to explain the situation. Maybe the cop was secretly a murderer and had killed previous owners of this house. Maybe his sacrifice helped them move on.\n\nI couldn't think of any other explanation for my good luck at the time. So I just pushed my misgivings down and got in.\n\nI drove out of the neighborhood without incident but I had new problems. I was in an unfamiliar city, driving a cop car, with no money or other belongings on me, and I had no idea what to do next.\n\nSo I kept driving. It felt good to be free of that house. It felt good to see the sun. So I kept driving. On and on.\n\nLeft turn.\n\nRight turn.\n\nLeft turn.\n\nRight turn.\n\nNo idea where I'm going.\n\nAnd then I realized I hadn't seen any other cars on the road for some time.\n\nWhere was everyone?\n\nWhere was I?\n\nThe sinking feeling happened again, in the pit of my stomach but also around my whole body. I sunk back into the car seat and then realized I was sitting in an armchair.\n\nBack in the living room of my Uncle's house.\n\nMy arms were up like I was still holding onto a steering wheel. I started to cry with frustration as I stood up and screamed.\n\nHow long had I been sitting there with a stupid grin, moving my arms up and down like a madman?\n\nI turned around and saw my work laptop on the dining room table. It was on and glowing at me. I walked over to it and saw that something was already written down in this post.\n\nIt read, \"Lost your mind? Good, now you won't mind losing the rest.\"\n\nSuddenly my fist felt weighed down. I raised it to find another kitchen knife in my hand. I dropped it immediately.\n\nI erased the message and started to type out a request for help. I ignored the screen and just focused on the keys. But I kept hitting them wrong and another message slowly formed.\n\n\"I'm sorry. I've disappointed you all. For the Last time, Goodbye.\"\n\nI could have screamed again but I noticed something had changed. I wasn't in the dining room anymore. I was in the study. I kept writing and writing and writing and my own words started to come out. \n\nI have sent out emails requesting help, I've posted on the local police department's Facebook for assistance, and I've just tried to keep writing no matter what.\n\nThis is my latest attempt to keep my sanity. Whenever I've tried to take a break, I find myself in a new room with new horrors descending on me.\n\nOnce I opened the study door out to a hellish landscape and almost stepped out onto lava. I wasn't sure if it was all an illusion but I didn't even want to have a vision of my feet burning so I just closed the door and resumed writing.\n\nI'm not even sure this is all because of ghosts.\n\nI've been doing a lot of thinking lately and the truth is simply that I have no idea what's going on.\n\nAs I've gone over these crazy events, I've realized that I can't recall my Uncle's name. Or what he looked like. I'm not sure I ever had an Uncle.\n\nI'm trying to think really hard about how I came here. Did I fly? Drive? I can't remember. Have I always been here?\n\nEven weirder, I can't remember my realtor's name or even what gender they are. I've met them, in person, several times. Why don't I know things I should?\n\nI can't even remember the name of my daughters or my wife. Am I even a father?\n\nAm I even a person? I know I must be because here I am writing in this small study. But now that I think about it, I can't remember who my parents are, what they look like, or anything about my childhood.\n\nNow, I just remember this house and all the nightmares, waking and otherwise, I've experienced here.\n\nI'm feeling a lot like I was back in the cop car. I found a way forward but I really don't know what to do next. This is not a way to live and I'm getting more and more tired.\n\nI'm so hungry.\n\nAnd I'm finding it harder to focus. I keep hearing voices. And they're getting louder.\n\nI  know if I stop writing. I won't last long. But I'm running out of things to say. My hands are tired. I'm tired. so tire.d\n\nABCDEFGHIJKLMNOPQRSTUVWXYZ\n\nThe quick brown fox jumped over the lazy dogs.\n\nI need to keep writing. But I don't know what to say anymore. What's my name?\n\nI don't know.\n\nI'll die if I stop writing. I'll die if I stop working.\n\nABCERGHIKLMNOQPRSTUVWYXANDZ\n\nThewquickbrownfaoxgumped ovethe lazy dogs. Dogs. Buster. I miss Buster.\n\nI wish I could pet him one last time. \n\nBut was he ever real? Is anything? I'm so tired. So hungry.\n\nI need to focus.\n\nThe quick brown fox jumped over the lazy goodbye.\n\nThequickbrownI'm sorryjumped ovrpointed you lazy dogsoodbye.\n\nI'm quick I've jumpeddisapp theall Last time lazy dogs\n\nI'm sorry. jumped over disappointed you lazy. For the Lazy dogs, Goodbye.\n\nI'm sorry. I've disappointed you all. For the Last time, Goodbye.",
        "upvotes": 3483,
        "url": "https://www.reddit.com/r/scarystories/comments/dcvw5l/this_is_not_a_suicide_note/"
    },
    {
        "title": "Run",
        "content": "Run\n\nRun. And if you can’t run then walk. \nAnd if you can’t walk, then crawl. But whatever you do, don’t stop. \n\nIt’s only been an hour since everyone on earth, as far as I could tell, heard those same words. I was already walking through the park when I heard them, and after seeing what happens, I won’t be stopping anytime soon. \n\nIt’s been two hours now, I’ve kept walking, I’m tired but stopping is not an option. Some people tried driving, but the act of getting in a car requires stopping, even for the briefest moment. And as those already driving when they heard the rules soon found out, it’s impossible to move indefinitely in a vehicle, especially in a crowded city. Their screams kept me moving. \n\nIt’s been four hours now, and I’m exhausted, with the only thing pushing me forward being the fear of what awaits when I stop. And yes, I mean when, proven by plenty of those around me, eventually I’ll have to stop. Some have just given up, accepting their fate only to immediately regret the decision, some just couldn’t take the screams anymore, and most simply don’t see the point of continuing. And with every step I’m starting to become more like the latter. \n\nIt’s been been about 6 hours, and for the first time i saw what happens up close. I was walking aimlessly down an alley, trying to get away from the madness, when I saw a young man no more then 16 crying. It didn’t even register at first to me until he made eye contact with me... he had stopped moving. His eyes were bloodshot, and not just whites around his pupils, I mean the entirety of his eyes were crimson red. Black tears streamed down his expressionless face, and then he smiled. A wide toothy smile that would’ve screamed of joy if it wasn’t followed by animalistic screams that would give the biggest horror fanatic nightmares. I wish I could say witnessing his dying moments was the most horrific thing to happen to me today, but then it hit me, the realization that I had stopped moving.",
        "upvotes": 3182,
        "url": "https://www.reddit.com/r/scarystories/comments/ijjshz/run/"
    },
    {
        "title": "Emergency Alert. Do not look outside your windows.",
        "content": "EMERGENCY ALERT.\n\n*Warning, this is not a test, I repeat, this is not a test. Citizens of the world. Lock all doors. Close all of your blinds. Do not go near any windows. Do not look outside. Do not leave your house. Stay in a room with no windows. Gather what supplies you can. Turn all of the lights off, do not open the door for anything.*\n\nWhen I first heard it, it didn't even sound real. It sounded fake, like something in a horror movie, but it was an emergency so I decided I probably should do what they tell me. I grabbed a flashlight, pillow, my phone, charger, food and basic other stuff to keep me entertained while this stuff happened. I had no idea what was going on, but once I got into my bathroom and got comfy, I texted my parents asking them if they got the alert. They also did. \"They said citizens of the world, did they actually broadcast that to world?\" I asked myself. So I texted an internet friend that lives across the world, and they said they got it too. Same exact message. And to be honest, it's kinda scary, they tell you what to do, but not what's going on, and people are scared of that.\n\n20 minutes later.\n\nEMERGENCY ALERT.\n\n*This is not a test, I repeat this is not a test. Unknown creatures have been knocking on peoples doors and been killing people that open the door. There is 5 major hotspots. Washington D.C, Tokyo, Toronto, Moscow and London. They have been located all around, but it seems as if they are attacking those first. This is an invasion. Stay in your rooms. Do not open any doors, do not look outside. They can kill you instantly with just a look. May god help us all*\n\nEmergency nuke sirens are going off, tornado sirens are going off. What is going on. Is this a prank? How can an invasion be real? Are aliens real? How can I even comprehend that? I head car alarms going off, I hear things being destroyed. They are here. They are killing. It sounds like a warzone out there but without any guns. What can the government do? Just shoot them? But they would die looking at them. There's no possible way we could ever survive this. We are going to die.\n\nI text my parents but no answer. I text my brother and sister, no answer. I start to panic now. What if my family is gone? And all I can do is listen to other peoples families get murdered. The nuke sirens have started again, and they are very loud. Shaking my whole apartment. I wonder what the other people in my building are thinking. Probably like me, this is it. This is the end of the world. Everyone on this planet will die. I hear a knock on my door. I don't answer it. I hear someone screaming for me to open it. I mean, it sounded human, should I open it? No. That would be stupid.\n\nEMERGENCY ALERT\n\n*This is not a test, I repeat, this is not a test, the extraterrestrial are attacking every major city in the world. There is a lot of them. We have not found out what they want. Stay inside. Millions if not billions are dead. Stay inside.*\n\nIt's as if the government have given up now. There's no way to fight and these messages are less helpful each time the come on. If billions are dying then I don't know how we can survive this. I mean, I have so far. But it doesn't sound like for long. I hear buildings being destroyed. I hear cars being destroyed. My building has been hit a few times. I'm hearing my world crumble before me. At this point there's no reason to hope anymore. There's so many dying and there is so much chaos, they will get everyone.\n\nI would love to know what one of these things looks like. But if I see them. I die. I hope someone takes a picture, and if we do survive, I want to see it. I want to see what's killing us. But the end is nowhere near and I don't even know how many people we have left. Should I just kill myself? Maybe I should die before they get me. I don't want to die by those things. Plus, what if I do survive and get survivors guilt? Then there's no way I-\n\nEMERGENCY ALERT\n\n*This is not a test, I repeat, this is not a test. The extraterrestrial have left, and left billions of people dead. If you are alive, please tap the button on your phone now. If on a radio, tune to 104 and state your name and city. We will update you in 20 minutes*\n\nThere's no way I would want to live. That's what I was going to say. And yet, somehow, I'm actually alive. Do I want to die now? Well no. But how many people are alive. What did these things want. Why did they attack us? There's too many questions to even ask right now. At this point all we can do is try to figure out some numbers and restart society. How can a world like ours recover from something like this. How long until society is normal again. Will humanity ever me the same? I don't know. What I do know, is that I could off lost everything. I will text my friends and family and come back with some numbers.\n\nEMERGENCY ALERT\n\n*This is not a test. I repeat this is not a test. We have reported a little over 1 billion people accounted for. Not every country has the technology so we will investigate those country's in the coming months. We do not understand what these creatures wanted, nor what they have taken. In the next month or two we will be figuring out the next steps for humanity. May god help us all.*\n\nOnly 3 people I know survived. My sister, my uncle and my best friend. Everyone else is dead. I want to kill myself. But at the same time, humanity needs me. We need each other to continue human life. Only time will tell what to do next. If there is anything next.\n\nEdit: It's 2 weeks later. The guilt is too much. I'm a fucking coward. Goodbye.",
        "upvotes": 2789,
        "url": "https://www.reddit.com/r/scarystories/comments/jkbgv7/emergency_alert_do_not_look_outside_your_windows/"
    },
    {
        "title": "Go back to sleep",
        "content": "",
        "upvotes": 2353,
        "url": "https://i.redd.it/9gmvnmgty1l51.jpg"
    },
    {
        "title": "My son was diagnosed with something far worse than cancer.",
        "content": "\n\n“Mommy, my privates hurt.”\n\nWas there any way for me to know how frightening those four words were at the time?\n\nLike any mother would do, I got on my knees. “Let me see,” \n\nMy five-year-old son pulled down his pants and showed me. As I looked, a shock of fear went through me. His testicles were red and swollen.\n\nI tried not to panic and thought about what it could be. Nothing - other than the worst-case scenario - came to mind. The night before, during bath time, his privates looked normal. \n\nWhat the hell happened?\n\nTrying my best to not scare my son, quietly, I told him to pull up his pants and put on his shoes. We arrived at the doctor's office 20 minutes later.\n\nAfter the examination, the doctor sent my son into the waiting room and called me in to have a private conversation.\n\nPrivate conversation - no pun intended.\n\n“Is it bad?” I asked.\n\nThe doctor gave me a look that I had scarcely ever seen. As if what I just asked was the biggest understatement of all time.\n\n“Is it cancer?”\n\n“Please sit down,” he said. “I haven’t seen anything like this during my time as a doctor that's for sure. I’ve already had a colleague of mine on the phone. We’re gonna need an ultrasound.”\n\nTears welled up in my eyes. “Tell me he’s going to be okay,”\n\n“I can’t say for sure, but I can tell you that if it is some type of cancer, testicular is the easiest to treat.”\n\nHe paused.\n\n”You said he’s 5 years old?”\n\nI nodded and said, ”I don't understand how his… You know... he hasn't reached puberty yet, so… this can’t be normal for a boy his age. Can it?”\n\n ”Before we jump to any conclusions,” the doctor said, ”We need to see the ultrasound.”\n\nBefore paying for the visit, the doctor handed me a note with the date and location of the hospital where the ultrasound would be done.\n\nHe also advised that I set an ice pack over my son's groin every 2 hours in case the irritation got worse.\n\nFirst thing the next morning, I drove to the address on the note and met with a man named Dr. Jasper Harris.\n\n“Hello,” He said to me, and then he looked down at my son. He kneeled to his level. “Hello. What's your name?”\n\nMy son answered. \n\nThe small talk was making me nervous. All I wanted was to get the procedure done and over with. The faster this would get done the faster my baby would get back to normal.\n\nDr. Harris led us both into a room and gave my son a hospital gown. \n\nI sat in the waiting room with a book while my son was scanned. Though I was looking at the pages, I wasn’t reading. My mind was elsewhere; on my son.\n\nLater, Dr. Harris came into the waiting room with a dour look on his face.\n\n“Come with me.” He said.\n\nHe brought me into a room full of medical computers.\n\n“Please take a seat,” \n\nHe pulled up a chair next to a large screen. He then showed me the X-Rays.\n\n“Oh my god,” I said and covered my mouth. \n\nThe X-Rays showed two testicles that were larger than any you’d see on a grown man. Both of them came up white on the ultrasound.\n\n“Surgery must be done immediately.” Dr. Harris said, “I’ve never seen anything like this. It seems as if the tumors have encapsulated his testicles.”\n\nI whimpered in the chair. A hand rested on my shoulder to console me. It didn’t help.\n\n“Please,” I said, “Save my son.”\n\nNothing could be done that day because of complications due to the Coronavirus. I was lucky enough to even have gotten an appointment for the ultrasound that day, so I counted my blessings and stayed patient.\n\nAt this point, my son was almost completely in the dark about the whole thing - or so I thought.\n\nWe were driving home from the hospital, he was sitting in his booster seat when he asked:\n\n“Mama?”\n\nI looked at his reflection in the mirror. “Yes?”\n\n“When we die, do we go to heaven like grandma says?”\n\nI was speechless. What was I supposed to say? And how did the idea of death get on his mind? Did the doctor say something to him? Was it just a coincidence? Or was there some kind of primal intuitiveness that made him aware of how severe his illness was?\n\nA single tear slipped down my cheek. “I don’t know, baby.”\n\n. . .\n\n\nHe lay there on the operating table, unconscious.\n\nThe surgeon and his helpers were shuffling about, preparing for the incision of the cancerous bulbs hanging between my son's legs.\n\nBefore my son was put under, he cried and made it clear that he wanted me in the room while the surgery was performed.\n\n“I want you with me,” He’d said.\n\nTo me it sounded as if he hadn’t finished the sentence; as if he was trying to say, “I want you with my incase I die.”\n\nI stood in the corner of the cold operation room wearing a medical apron, rubber gloves, face mask, and a pair of goggles. I was looking at my feet, waiting for the inevitable. \n\nWould he be a freak to his peers?\n\nAn outcast to society?\n\nWould he ever find someone to love him? Not as a mother, but as a lover? \n\nThese strange, unwanted thoughts floated in my mind like a rocket on a predetermined trajectory through the star systems of the cosmos.\n\nThey told me not to watch if I didn’t want to. I wasn’t, but once I heard the scalpel cut through flesh, there was this sound. A wriggling sound. A sloppy, greasy… writhing sound.\n\nThe bodies of the medical professionals surrounded my son so I was unable to see him. I stood on my toes but I still wasn’t tall enough to see.\n\n“Oh my god,” a nurse said.\n\n“What the…” The surgeon said through his covered face.\n\nWet slapping sounds came. Something was dropping on the room's floor. \n\nBlood?\n\nThe doctor and nurses stood back. One nurse yipped and dropped a stainless steel tool she had been holding. She ran out of the room, the doors swinging behind her.\n\nThe sound of wet drips still came. I looked at the surgeon's feet. Something was wiggling on the floor.\n\nSnakes?\n\nNo, too small for that.\n\nCentipede? \n\nNo, they didn’t have legs.\n\nAs the surgeon and the remaining nurse moved away from the table, I was able to see everything.\n\nEverything.\n\nCracked open like eggs.\n\nHoney, breakfast is ready.\n\nComing mom.\n\nMommy?\n\nYes?\n\nMy privates hurt.\n\nParasite?\n\nWet goo and slime from a world far beyond the comprehension of the human imagination spewed out from between my baby's legs. But no… let's not be too melodramatic.\n\nI’ll just say it clearly and simply: My son's testicles had a nest of fucking worms inside of them. \n\nThey writhed and squirmed and moved and slopped over the table; down to the floor, and over the shoes of the surgeon and nurse.\n\nAnd guess what? Next thing I remember was blackness. I fainted and cracked my head on the tile floor.\n\nI was removed from the room and woke up in a chair located in the large waiting area.  I remember squinting because the chair I was sitting in faced the windows where the sunset was.\n\nWhere was I?\n\nRight, the hospital, 3rd floor.\n\nA nurse with scrubs that were a size too small for her came over with a cup of water. \n\nHow did they allow nurses to wear that? Her boobs were practically hanging…\n\n“Ma’am?”\n\nI blinked, and then my eyes focused on the nurse's face. \n\n“Y—yes?” I said.\n\n“Please drink this,”\n\n“My son,” I bolted straight up, “Where’s my son? Those things. Is he alright—“\n\nWater tipped over the rim of the paper cup as she put a hand on my shoulder to sit me back down.\n\n“He’s fine,” she answered, “There were just a few minor complications.”\n\nMinor complications? Haha, very funny, wiggle wiggle woo. \n\n“He lost some blood but the procedure is over. You can see him in a few hours.”\n\nI talked to the surgeon about what happened at the operation table. The only answer I got regarding what was inside of my son was: \n\n“We’re not completely sure what they are or what species of parasitic organisms they belong to. We’ve run some tests to see if he still had any left inside but we're not sure if he’s clean. We’ll have to put him on Mebendazole. It's the best we can do for now.”\n\nAnd that was it. The men in the black suits showed up to interview me, my son, the surgeon, and both nurses.\n\nWho were they? The fuck would I know?\n\n. . .\n\nIt’s been two months since the operation. My son had to stay in a rehabilitation center for about a month and a half, which wasn’t fun for either of us. \n\nI’m now on anxiety medication. It started the day after I took my son home for the first time in a while. I just lay awake at night worrying about him.\n\nFrequently, like every five minutes, I would get out of bed and go into his room to check on him. \n\nI wouldn’t get any sleep and I had to spend time away from work.\n\nThings have been hard lately because of it, child support is next to nothing, no thanks to my ex-husband; at least it seems like the medication is working, so now I'm able to sleep.\n\nThey sent my son home with a clean bill of health minus two testicles - or so they thought.\n\nI’m sitting in a waiting room once again.\n\nYesterday, while eating a bowl of cereal and watching the idiot box, my son stepped out of his bedroom and shuffled into the kitchen.\n\nHe said four words.\n\n“Mommy, my eyes hurt.”",
        "upvotes": 2093,
        "url": "https://www.reddit.com/r/scarystories/comments/jmuc22/my_son_was_diagnosed_with_something_far_worse/"
    }
]